Revit 2024 API
XYZ.X Property
Gets the first coordinate.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double X { get; }
Visual Basic
Public ReadOnly Property X As Double
	Get
Visual C++
public:
property double X {
	double get ();
}
See Also
XYZ Class
Autodesk.Revit.DB Namespace